{
  "articles": [
    {
      "thumbnail": {
        "src": "https://centralca.cdn-anvilcms.net/media/images/2024/03/02/images/library_events.max-900x400.jpg",
        "alt": "Library events March"
      },
      "headline": "Library offers craft projects, book club, teen poetry workshop in March",
      "href": "https://www.turlockjournal.com/news/local/library-offers-craft-projects-book-club-teen-poetry-workshop-march/",
      "article": {
        "img": {
          "src": "https://centralca.cdn-anvilcms.net/media/images/2024/03/02/images/library_events.max-1200x675.jpg"
        },
        "content": [
          "March events at the Turlock Library will start with the Read to a Dog program from noon to 1 p.m. today. Independent readers up to age 12 are invited to practice their reading skills. This program is designed to help children gain confidence in their reading skills by reading aloud to certified therapy dogs. Participants must pre-register the readers online as space is limited.",
          "The library will host an all-ages coloring project at 4 p.m. Tuesday. Participants can add their artistic flair to a coloring banner, or strike it solo with coloring pages. All ages are welcome; children under 4 must have direct adult supervision.",
          "The Friends of the Turlock Library will meet at 6:30 p.m. March 6. Visitors are welcome to attend.",
          "A Maker Space project to sew an origami book bag will be held at 1 p.m. March 8. Sewing materials and machines will be provided. This program is designed for ages 18 and up. Registration is required; please individually register each person attending.",
          "The Mystery Lovers Book Club will meet at 10:30 a.m. March 11. This month’s book is “The Never Game” by Jeffrey Deaver. A young woman has gone missing in Silicon Valley and her father has hired Colter Shaw to find her. The son of a survivalist family, Shaw is an expert tracker. Now he makes a living as a \"reward seeker,\" traveling the country to help police solve crimes and private citizens locate missing persons. But what seems a simple investigation quickly thrusts him into the dark heart of America's tech hub and the cutthroat billion-dollar video-gaming industry.",
          "At the March 12 T(w)een Tuesday event, participants will build LEGO creations using the library’s LEGO blocks and bring them to life with stop-motion film. This program is designed for ages 9 and older. This event starts at 4 p.m.",
          "AARP Foundation will host a tax-aide session from noon to 3 p.m. March 13, 20 and 27. Participants can receive free tax preparation assistance from IRS-trained AARP volunteers. Walk-ins are welcome, as there is not an option for advance registration.",
          "The Turlock Teen Anime Club will meet at 3:30 p.m. March 13 at the library. Teens are invited join the club they watch anime and make a fun craft. This month, the club will watch “Black Clover” (TV-PG).",
          "Painless Poetry, a workshop for aspiring teen poets on performance strategies, will be held at 2 p.m. March 16. How do you inhabit the space on stage when performing a piece? How about holding a microphone and reading from a page? Join Faith Delgado, 2023-24 Stanislaus County Youth Poet Laureate, at the library as she shares strategies and explores what might work while performing spoken word poetry. This program is presented in partnership with Modesto-Stanislaus Poetry Center (MoSt).",
          "A STEAM (science, technology, engineering, art, math) session on binary initials will be held at 4 p.m. March 19. Participants will learn how to make a keychain using pony beads that spell out their initials in the binary computer language. This program is designed for children under 8, but all ages are welcome. Children under 4 must have direct adult supervision.",
          "At the March 19 T(w)een Tuesday event, participants will learn coding by creating fun animations using OctoStudio. No prior coding experience necessary. This program is designed for ages 9 and up. This event starts at 4 p.m.",
          "The Turlock Chess Club will meet at 5 p.m. March 20 at the library. Players who are amateurs, masters, or somewhere between are invited to bring their own board to meet and play against others for practice or friendly competition.",
          "Children are welcome to build a house for a Peep at 4 p.m. March 26 at the Turlock Library. Participants will use graham crackers and icing to design, build, and decorate a house for a marshmallow chick. All ages are welcome; children under 4 must have direct adult supervision.",
          "The UCCE Master Gardeners will host a session at the library at 6 p.m. March 27 about garden weed identification and management. Participants will learn how to identify common weeds and hear options for the best practices to manage and prevent them.",
          "The Turlock Library is located at 550 Minaret Ave. Hours are 10 a.m. to 6 p.m. Monday, Tuesday and Thursday; noon to 8 p.m. Wednesday; and 10 a.m. to 5 p.m. Saturday.",
          "To register for specific library events, visit: https://www.stanislauslibrary.org/"
        ]
      }
    },
    {
      "thumbnail": {
        "src": "https://centralca.cdn-anvilcms.net/media/images/2024/03/02/images/Library_presents.a14f9f02.fill-600x500-c80.jpg",
        "alt": "Chris Bohjalian"
      },
      "headline": "Author of ‘The Flight Attendant’ coming to Turlock",
      "href": "https://www.turlockjournal.com/news/local/author-of-the-flight-attendant-coming-to-turlock/",
      "article": {
        "img": {
          "src": "https://centralca.cdn-anvilcms.net/media/images/2024/03/02/images/Library_presents.max-1200x675.jpg"
        },
        "content": [
          "The Library Presents, a program that has already hosted a trio of well-known authors to Turlock, is bringing Chris Bohjalian, the best-selling novelist of “The Flight Attendant” and “The Lioness” to town in April.",
          "Bohjalian will be at the Carnegie Arts Center at 2 p.m. April 6 for a discussion about his works. Tickets for the event are $15.",
          "Bohjalian is a graduate of Amherst College and originally started his career trajectory as an account representative for a New York ad agency. In 1988, he and his wife, photographer Victoria Blewer, moved to Lincoln, Vermont, a town with a population of 975 people. Bohjalian’s writing career began by writing for The Burlington Free Press newspaper in Vermont about his experiences of life in the small town. It ran from 1992 through 2015 and won a Best Lifestyle Column from the Vermont Press Association. He expanded his freelance writing to include stories in Cosmopolitan, Reader's Digest, The New York Times, and the Boston Globe Sunday Magazine.",
          "His first novel “A Killing in the Real World” was published in 1988 and was followed by “Hangman” in 1991, “Past the Bleachers” in 1992 and “Water Witches” in 1995.",
          "Bohjalian’s writing career reached a new height in 1997 when his novel “Midwives” was released in 1997. It was selected for Oprah’s Book Club in October of 1998 and became a best-selling novel on the New York Times and USA Today. The novel tells the story of rural Vermont midwife Sibyl Danforth, whose life and career are upended when a patient dies during an emergency Caesarean section. The book was adapted into a television film starring Sissy Spacek.",
          "In total, Bohjalian has published 24 novels. His work has been translated into 35 languages and become three movies and an Emmy-nominated TV series. His books have been chosen as Best Books of the Year by the Washington Post, the St. Louis Post-Dispatch, the Hartford Courant, the Milwaukee Journal-Sentinel, Publishers Weekly, Library Journal, Kirkus Reviews, Bookpage, and Salon.",
          "His 2018 novel, “The Flight Attendant,” debuted as a New York Times, USA Today, Wall Street Journal, Publishers Weekly, and National Indiebound Bestseller. It is now HBO Max TV series, starring Kaley Cuoco. Season two landed in April 2022.",
          "He is also a playwright and screenwriter. He has a new play, “The Club,” arriving at the George Street Playhouse in February 2024. His other plays include his adaptation of his novel, “Midwives,” and “Wingspan,” (originally called “Grounded”).",
          "His latest novel “The Princess of Las Vegas” comes out March 19.",
          "Bohjalian’s appearance in Turlock is sponsored by the Ralph Shabazian Memorial Trust. Shabazian, a Turlock resident who passed in 2022, was of Armenian descent and his final wishes included requests that his donations be used in part to help highlight the rich history and culture of Armenia. Bohjalian is an Armenian-American.",
          "The Library Presents was formed with an eye towards securing programs that appeal to children, teens and/or adults and connect the community. The program is overseen by the Friends of the Turlock Library. A large donation launched the program and has previously brought best-selling authors Jamie Ford, Tara Westover and Lisa Wingate to town. The program is overseen by the Friends of the Turlock Public Library.",
          "“Because we’ve had three authors now, it feels like the people that are there at these events feel like it is a real treat,” said Jane Cuff, a FOTPL board member and chair of the committee responsible for hosting the event. “We get to go to our beautiful Carnegie Arts Center and hear this amazing author and we get to interact with other people who love reading as well.”",
          "Tickets for the event are available at https://friends-of-the-turlock-library.ticketleap.com/the-library-presents-chris-bohjalian/?fbclid=IwAR372S74-S0epxHzvzV_Xk0qcL3ne4VcNEOXloGZUJWsuA4M7FgBVt7Pah0.",
          ""
        ]
      }
    },
    {
      "thumbnail": {
        "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/28/images/Williams_family.de2c6687.fill-600x500-c80.jpg",
        "alt": "John Williams poster"
      },
      "headline": "Don’t stop until the whistle blows",
      "href": "https://www.turlockjournal.com/news/local/dont-stop-until-the-whistle-blows/",
      "article": {
        "img": {
          "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/28/images/Williams_family.max-1200x675.jpg"
        },
        "content": [
          "There are several life lessons that Johnathan Williams taught his five children.",
          "Don’t eat ice cream off a paper plate.",
          "If you visit the house more than once, you are no longer a guest, you are family.",
          "Never say sorry on the basketball court.",
          "Don’t stop until the whistle blows.",
          "That last one was meant for the basketball court as well but it is now a lesson they will be putting into practice as they continue to process the loss of their father and deal with the arrest of a teenage suspect.",
          "Williams. 48, was killed in a three-vehicle collision that happened on Dec. 29, 2023, in the area of West Christoffersen Parkway and North Kilroy Road, near Pitman High School. Williams was a passenger in a 2018 Dodge Journey driven by his 19-year-old son, Jordan Williams.",
          "Jordan was on W. Christophersen Parkway and was preparing to turn left onto N. Kilroy Road when the Dodge was struck by a Toyota Camry driven by a 16-year-old boy. (He has since turned 17).",
          "The investigation by the Turlock Police Department’s Major Accident Investigation Team found that the Camry driver was traveling at 95 miles per hour as he approached the intersection. The report said he sped up to 98 miles per hour in the 2.1 seconds before he hit the brakes and collided with the Dodge.",
          "The Camry struck the Dodge at an approximate speed of 60 miles per hour, according to the MAIT report.",
          "The force of the collision sent the Camry into a third vehicle that was stopped at the intersection.",
          "The MAIT report stated Jordan showed “due regard as he entered the intersection on a green light and began his turn on a yellow light. At this time the Toyota Camry was more than 550 feet south of the intersection.”",
          "The report concluded that the Camry would not have been in the intersection if the teen driver had not been speeding. According to the report, the teenager told the officers he was “trying to beat the yellow light.”",
          "The 17-year-old boy has been arrested and booked on suspicion of vehicular manslaughter with gross negligence, failure to obey restricted driver’s license provisions, unsafe speed, and reckless driving resulting in bodily injury.",
          "Williams, also known as “Big John,” was a fixture in Turlock basketball for many years. He was actively involved in youth camps and was the longtime assistant for Turlock’s boys varsity basketball team alongside Doug Cornfoot. In 2019, he took the helm as the Bulldogs’ varsity girls head coach. He served in the position until midway through the 2020-21 season. Since then, he has served as an assistant for both Cornfoot and current girls head coach Erica Hernandez.",
          "Many in the community knew Williams from the many years he coached youth and high school basketball. He was a towering figure on the sidelines and in the lives of his children and his absence has hit them unexpectedly, especially to not see or hear him on the basketball court.",
          "“He worked at the Tesla plant in Fremont,” said Shea Williams, who along with her sister Jaydon Williams, sat down with the Journal at their attorney Adam Stewart’s office in Modesto, to discuss their father and the recent arrest of a 17-year-old boy in connection to his death. “He would wake up at three or four in the morning to go to work to get back in time to be able to make it to essentially all our games, since we were in junior high. And then on top of that he was coaching.”",
          "“Last year I was at Humboldt and there was one game where he had worked all day then drove six hours just to watch me play and then drive back after my game,” Jaydon said. “When I think about him, I think about that game and how dedicated he was. That shows a lot about his character. He was always family first.”",
          "One of William’s greatest joys, according to his daughters, was that he got to coach all of his children on the basketball court, one of his other great passions. But if they ever thought that being the coach’s kid would afford them some special privileges, he was quick to set them straight.",
          "“He actually cut my brother in his senior year,” Shea said. “Our brother tried out his senior year, but he didn’t really have the passion for it, so, he didn’t make the team. Our dad loved the competitiveness and hated losing. So, he was always going to do what was best for the team.”",
          "He also strove to do what was best for the young players he was helping mold, both on and off the court, his daughters said.",
          "“He treated all his players like they were his own children and was very protective of them,” Jaydon said.",
          "Given the commitment that he showed to helping kids, the fact that it was a teen driver accused of causing the collision adds another layer of grief for the family.",
          "“You learn from your mistakes. That’s something we were all taught from when we were very little, even on the basketball court,” Shea said. “He also believed in consequences. If you got caught doing something wrong there were going to be consequences. But he would also tell us that this one mistake doesn’t have to define you for the rest of your life. So, I think that he would want to see justice served but not have it ruin this kid’s life.”",
          "The family also wanted to express their gratitude to the entire community and all the basketball teams around the region. They have had meal trains, monetary donations and scholarships established in his memory.",
          "“We want to thank everyone that has been there for us,” Jaydon said.",
          ""
        ]
      }
    },
    {
      "thumbnail": {
        "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/28/images/Diva_Honorees_2024.cae26792.fill-600x500-c80.jpg",
        "alt": "Divas 2024"
      },
      "headline": "Meet 2024’s Divas",
      "href": "https://www.turlockjournal.com/news/local/meet-2024s-divas/",
      "article": {
        "img": {
          "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/28/images/Diva_Honorees_2024.max-1200x675.jpg"
        },
        "content": [
          "The annual Divas luncheon is returning for its eighth year on Match 9 in an effort to raise money for the Salvation Army Turlock Corps.",
          "The Divas event was started as a way to recognize women who go above and beyond to give back to the Turlock community. Attendees are treated to a luncheon, fashion show, opportunity drawing and a live auction.",
          "“Divas honors women in our community who are doing good things… sometimes quietly behind the scenes and sometimes out in the front with a loud voice. A true diva also empowers and celebrates other women,” said event chair Kristin Bettencourt.",
          "Being honored this year is Candace Gonsalves, Wanda Bonnel, Liz Padilla and Kimberly Weese. The late Pat Portwood will also be a posthumous honoree while Off Center Thrift and Gift will be the year’s group honoree.",
          "Gonsalves is the owner of Farm House, a home decor and gift shop in Turlock. Every year, Gonsalves spearheads Photos with Santa alongside Stephanie Baker Photography, with all proceeds benefiting Westside Ministries. She also helped kickstart the annual Shop the Blocks event in downtown Turlock, held annually on the first Sunday of November to promote Turlock’s downtown and the upcoming holiday shopping season. Additionally, she is involved with activities at Chatom Elementary School, serving as president of their parent-teacher club and is a driving force behind their annual Halloween carnival. Several years ago, she began fundraising efforts that were closer to home when her niece, Bella, was diagnosed with leukemia at six years old.",
          "Bonnel worked in higher education for over 25 years with extensive experience with former foster youth, developing the Promise Scholars Foster Youth Program at California State University, Stanislaus and serving as the coordinator for 10 years prior to her retirement. Her contributions to the Promise Scholars Program and the university is reflected in her numerous awards and recognitions. She is also involved in several service organizations including the American Association of University Women. She was recently given an honorary doctorate degree from Stanislaus State.",
          "Padilla is on the forefront of Helping Hands Ministry, which provides care and resources to those less fortunate in the community, including homeless individuals. Padilla and Helping Hands are known for cleaning up the downtown area while providing clothes and hygiene products for those who are unhoused. Padilla has also held fundraisers to give burials for some of the unsheltered individuals who have passed away. She has also been known to advocate for homeless individuals.",
          "Weese is a local Realtor and owns Valley Heritage Realty alongside her husband, Neil. The couple are members of Advancing Children of Turlock, which is a social group committed to building opportunities for underprivileged children across the city. Nearly a decade ago, she helped launch the Kettle Dash 5K to help raise funds for the Salvation Army, where she has also volunteered every year.",
          "Portwood, who passed away on Nov. 2, 2023, at the age of 77, will be honored posthumously for her life of service. She joined the Stanislaus Library Foundation in 2010 and coordinated the Measure T campaign in Turlock for funding of the library system. She also served as the county co-chair for the Measure S campaign in 2017, which extended library funding for the system through 2029. As president of the Friends of the Turlock Library, she chaired the capital campaign which made possible the renovation of the library. Working with other volunteers in that group, she also spearheaded a program that brings well-known authors to speak to local audiences. She also held key leadership positions with the Turlock-Modesto Branch of American Association of University Women, the Tuesday Reading Club, Stanislaus County Commission for Women and served as Meet & Learn coordinator for the Stanislaus County League of Women Voters.",
          "The group honoree, the folks of Off Center Thrift and Gift, will be recognized for their over $1 million in donations to local organizations, including Relay for Life, Jessica’s House, the Turlock Autism Group, the Turlock Gospel Mission, the Denair Gaslight Theatre, the Women’s and Children Center, Friends of the Turlock Library, United Samaritans, Turlock Community Theatre, Camp Taylor, Lions’ Clubs, high school sober grad nights and more.",
          "The March 9 event will be held at 12 noon at the Carnegie Arts Center. Tickets are $50 or $480 for a table of eight. There are also several sponsorship opportunities available. Those interested can contact Bettencourt at (209) 850-1851 or the Salvation Army at (209) 667-6091.",
          ""
        ]
      }
    },
    {
      "thumbnail": {
        "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/28/images/Mister-Car-Wash.9cf19d24.fill-600x500-c80.jpg",
        "alt": "Mister Car Wash"
      },
      "headline": "More Mister Car Wash",
      "href": "https://www.turlockjournal.com/news/local/more-mister-car-wash/",
      "article": {
        "img": {
          "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/28/images/Mister-Car-Wash.max-1200x675.jpg"
        },
        "content": [
          "If the number of car washing businesses in Turlock is any indication as to whether locals enjoy doing the job themselves, the answer should be pretty clear.",
          "The city of Turlock is currently home to six standalone car washes, as well as four others that are housed at gas stations. Back in November, an application was submitted to the City of Turlock for Mister Car Wash, a Houston-based car wash company, to build their fourth location in the city. The site of the proposed 5,940 square-foot project is 2530 W. Tuolumne Rd., a vacant lot right off of Countryside Drive sitting directly next to fast-food restaurant Farmer Boys.",
          "Like the existing Mister Car Wash locations in Turlock — 1400 Geer Rd., 487 N. Golden State Blvd. and 980 W. Monte Vista Ave. — the proposed location on Tuolumne would have an automated car wash facility with free, self-service vacuum stalls. Additionally, the location would have the same business hours, open daily from 7 a.m. to 7 p.m.",
          "According to the applicant, CWP California Corp., an estimated 20 to 25 employees will be hired once the car wash opens."
        ]
      }
    },
    {
      "thumbnail": {
        "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/24/images/Hulk_comes_to_Turlock_1.16502d70.fill-300x200.jpg",
        "alt": "Lou Ferringo 1"
      },
      "headline": "Famed ‘Hulk’ actor Lou Ferrigno coming to Turlock",
      "href": "https://www.turlockjournal.com/news/local/famed-hulk-actor-lou-ferrigno-coming-to-turlock/",
      "article": {
        "img": {
          "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/24/images/Hulk_comes_to_Turlock_1.max-1200x675.jpg"
        },
        "content": [
          "Lou Ferrigno, the American actor best known for playing the Hulk in the hit 1970s and 1980s television show “The Incredible Hulk,” will be making an appearance at Turlock Comics on March 9. Thankfully for the shop and for locals, he will not be smashing everything in his sight, and instead will be there to sign memorabilia and take photos with fans.",
          "Ferrigno will be at Turlock Comics at 2717 Geer Rd. from 5 p.m. to 7 p.m. He will sign 8x10 photos for $50, with specials including two 8x10s for $80 and three for $100. Fans can also bring in personal items for Ferrigno to sign for $100, or $60 if made out to anyone’s name. Selfies will cost $50, while group photos will run for $80 and video messages will cost $100.",
          "",
          "",
          "Aside from his role as the Hulk, Ferrigno has appeared in the films “Hercules” (1983) and “Sinbad of the Seven Seas” (1989), as well as the 2000s sitcom “The King of Queens.” Prior to his acting career, Ferrigno was a bodybuilder, winning an International Fitness and Bodybuilding Federation’s Mr. America title and two consecutive Mr. Universe titles.",
          "“No matter where you became a fan of Lou Ferrigno, he is a pop culture icon and celebrity,” the shop said in a statement.",
          "Turlock Comics will have several Hulk and Hercules items for sale for those who don’t have anything for Ferrigno to sign.",
          "The event will serve as the first celebrity meet-and-greet hosted by Turlock Comics, which is owned by armed service veterans Joey Aiello and Kyle Turner. The duo opened the hobby shop in June 2022.",
          "Turlock Comics can be reached by phone at (209) 620-8190, by email at turlockcomics@gmail.com, or through social media at @Turlock_Comics on Instagram and Facebook for any questions or additional information."
        ]
      }
    },
    {
      "thumbnail": {
        "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/24/images/google_developer_group2.b4a0cb89.fill-300x200.jpg",
        "alt": "Google Developer Group"
      },
      "headline": "Google Developer Group established in Turlock",
      "href": "https://www.turlockjournal.com/news/local/google-developer-group-established-turlock/",
      "article": {
        "img": {
          "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/24/images/google_developer_group2.max-1200x675.jpg"
        },
        "content": [
          "Community members interested in technology and web development will have a unique opportunity to learn more about the growing industry and network with like-minded individuals thanks to the launch of a Google Developer Group in Turlock.",
          "Turlock’s first-ever Google Developer Group will host a launch party on March 14 at Willie’s Pizza and Wings. It will join the over 1,000 existing chapters across 140 countries. Google Developer Groups aim to connect local developers and technology enthusiasts to learn about technical topics and gain new skills through hands-on workshops, training, events, talks and meetups, both online and in-person. They also encourage members to apply knowledge and connections to build products and make career advancements.",
          "Appointed as chapter leader for the new group is Kelley Coelho, a veteran of the U.S. Army Reserves, a private investigator and founder of B and C Investigations. Coelho admittingly doesn’t have the most extensive background in technology, though she has seen the impacts of technology in businesses and everyday life first-hand.",
          "“I really don't have a huge background in tech, but I've connected with people and I’ve seen how important it is while at other companies that I've been involved with. They work hand in hand with it. Technology keeps things very streamlined through an organization. So that's what the really nice part is,” Coelho said. “I’m grateful to be appointed to this position even though I don't have that background because I’m passionate and I want to learn, get involved and help others navigate this growing industry. This is an opportunity for people from all backgrounds to come together, whether they are experts or if they are just wanting to learn.”",
          "Every Google Developer Group across the globe meets on a monthly basis, discussing varying topics like Google tools, web and software development, technology solutions, tech careers and technological advancements like artificial intelligence. Chapter leaders meet with Google representatives each week to discuss new Google technologies, industry news and to collaborate on projects.",
          "“The thing about tech is that there's always new stuff coming out. I think it's really nice to be surrounded by a really great group learning together and collaborating,” Coelho said.",
          "Speaking at next month’s launch will be Gustavo Nava of Livermore Labs, who will talk about how he got his start in the tech industry.",
          "“It’s things like this that are important to share,” Coelho said. “Turlock is growing and the industry is growing, and there are a lot of opportunities coming about and more people are becoming interested, but they just don’t know where to start or they don’t know how to move up… This can help somebody get further. With these Google connections, you’re able to build some really great relationships. I think this will definitely bring more opportunities to Turlock and people are going to have more of an open mindset.”",
          "There is no charge to join a Google Developer Club. The March 14 launch party will run from 6 p.m. to 7 p.m. For more information, head to https://gdg.community.dev/gdg-turlock.",
          ""
        ]
      }
    },
    {
      "thumbnail": {
        "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/24/images/Legacy_Nursing.763c0d11.fill-300x200.jpg",
        "alt": "Jonnie York"
      },
      "headline": "New Legacy Health nursing scholarship program offers free tuition for local BSN students",
      "href": "https://www.turlockjournal.com/news/local/new-legacy-health-nursing-scholarship-program-offers-free-tuition-local-bsn-students/",
      "article": {
        "img": {
          "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/24/images/Legacy_Nursing.max-1200x675.jpg"
        },
        "content": [
          "A new scholarship program through Legacy Heath Endowment aims to educate more nurses to serve local communities.",
          "The Jonnie York Nursing Scholarship will cover full tuition, books, and equipment up to $60,000 for local students who have been accepted into an accredited Bachelor of Science Nursing Program or accredited Accelerated Bachelor of Science Nursing program (ABSN). This includes students from Modesto Junior College (MJC) who have already obtained their registered nurse (RN) degree.",
          "Upon completing their studies, graduates must return to work as nurses for two years at a nonprofit or for-profit entity within the communities the Legacy Health Endowment serves.",
          "“Our goal is to rebuild the Central Valley's nursing infrastructure with individuals who grew up in the region and would be more inclined to live and work in the Central Valley, ensuring that all its residents can access quality registered nursing services provided by culturally appropriate trained professionals. The hope is that every local ethnic group will have students who want to become a York Fellow,” said Jeffrey Lewis, President and CEO of LHE, in a press release.",
          "The new scholarship program is named after Denair resident and retired nurse Jonnie York. During her decades-long career, York worked as a public health nurse with Stanislaus County in the Child Health and Disease Prevention Department, worked with in-home and public health nursing and helped people with unmet needs find health and wellness services.",
          "“I am deeply honored by the creation of this program. Educating more nurses and nurse practitioners will help ensure our communities have access to better healthcare, and it is time people realize that nurses are the true frontline of the healthcare workforce,” said York in a press release.",
          "During her years working as a registered nurse in Stanislaus County, there was one problem York saw over and over again — a lack of medical professionals in the local area.",
          "Whether it was the “working poor” as York called the patients she saw through the county health department or pregnant women seeking prenatal care, getting an appointment with a doctor is difficult due to a high demand and medical professionals.",
          "York was on the Legacy Health Endowment Board when they helped establish the Family Nurse Practitioner master’s program at Stanislaus State in 2018. She advocated at the time for extending the help further “upstream” by reaching nursing students before they obtained their bachelor’s degree to encourage them to continue their professional education.",
          "“If we want more people going into the master's program, then we need to help more people become bachelor’s prepared, and even eventually help more people get their a nursing through MJC…because that would increase the number of people getting to the end goal, which is to get more providers in the area,” said York in an interview with the Journal.",
          "To obtain more information about the fellowship program or to apply, email allie@legacyhealthendowment.org or jeffrey@legacyhealthendowment.org",
          "",
          ""
        ]
      }
    },
    {
      "thumbnail": {
        "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/21/images/Amazon_Warriors.eeebaf2b.fill-300x200.png",
        "alt": "Amazon warriors"
      },
      "headline": "Making a World of Difference",
      "href": "https://www.turlockjournal.com/news/local/making-world-difference/",
      "article": {
        "img": {
          "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/21/images/Amazon_Warriors.max-1200x675.png"
        },
        "content": [
          "Employees at Turlock’s Amazon fulfillment center — as well as those across the nation — took time out of their schedules to show their support for wounded veterans.",
          "Amazon employees engaged in a fundraising campaign in the days leading up to Veterans Day to support the Wounded Warrior Project.",
          "The “Making a World of Difference” fundraiser allowed employees to keep track of their running miles or their hours of volunteer service. The fulfillment center logging the most employee miles (volunteer hours included) would win the grand prize and get to present a $50,000 check, donated by Amazon, to the Wounded Warriors Project on March 12 in San Diego.",
          "The goal was to log 24,901 miles – enough to circle the globe. The 2,013 participants totaled 42,182 miles.",
          "Despite the company's hectic schedule before the holiday season, all 79 fulfillment sites participated in the campaign, with the ONT9 fulfillment center in Moreno Valley winning the grand prize. Amazon’s MCE1 fulfillment center in Turlock took fourth place nationwide, with 94 runners participating and more than 1,800 miles logged.",
          "The campaign also helped support Wear Blue, an organization that honors veterans and their families through running events.",
          "Amazon currently employs more than 40,000 veterans and military spouses across multiple businesses and is committed to hiring 100,000 veterans and military spouses by 2024.",
          "Craig Norris, the general manager at Amazon’s MCE1 fulfillment center in Turlock, was instrumental in organizing the event.",
          "“Amazon invests in supporting veterans and their families. In addition to our commitment to hire veterans and help transition them back into civilian life, we work to find ways to support veterans within our local communities,\" said Norris, whose father was a member the U.S. Marine Corps and served in Vietnam. \"We are grateful to partner with Wounded Warrior Project this year to create a fun and impactful way for our employees to participate and show support for veterans across our operations throughout the country.”",
          "Norris said that talks are already underway for another event this year.",
          "“We were really excited to see the turnout,” said Norris. “It was just amazing. We’re looking at different non-profit organizations who want to partner with us. We definitely want to build on what we started.”",
          "Since 2003, WWP has helped been helping meet the needs of military families and their caregivers.",
          "“We're deeply grateful to Amazon and their incredible teams behind this fundraising initiative,” said Wally Edwards, corporate partnerships director for WWP. “Their support not only impacts the lives of veterans and their families but also fuels the heart of Wounded Warrior Project. Supporters like Amazon allow us to be there for wounded warriors, now and in the future.”"
        ]
      }
    },
    {
      "thumbnail": {
        "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/21/images/cherry_facility_hiring.7986b439.fill-300x200.jpg",
        "alt": "cherry farm"
      },
      "headline": "New cherry packing facility now hiring",
      "href": "https://www.turlockjournal.com/news/local/new-cherry-packing-facility-now-hiring/",
      "article": {
        "img": {
          "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/21/images/cherry_facility_hiring.max-1200x675.jpg"
        },
        "content": [
          "Twenty-eight years ago when the Iyer family purchased a charry farm on the outskirts of Gustine, they did it with the vision that they could cultivate the 20-acres into a successful operation.",
          "One hiccup, however, existed. Those initial cherries were not good. In fact, Managing Partner Lax Iyer described them as “old” and “nasty.”",
          "“But we used them to learn,” Iyer said. And learn they did.",
          "From studying climates, soils, growth patterns, packaging and everything else related to cherries, Iyer threw himself into growing the best quality cherry he could.",
          "“We are in the business of satisfying customers with amazing flavor,” Iyer said. \"That has been our goal from day one.”",
          "Today, Meena Farms, which has grown to 800 acres of cherry trees, is known across the globe for their flavorful harvest and superior quality. Their orchards became a place where tradition met innovation when they opened a custom packing operation and are currently embarking on Meena Packing, which will see the entire operation from harvest to packing all at one facility, rather than having the cherries shipped to another facility to be packed and then loaded up for shipping, all of which can impact the flavor, explained General Manager Chris Medeiros.",
          "“As soon as you pull that cherry from the tree, its time clock starts,” Medeiros said. “It’s like sand in the hourglass and you only have so much time to get it from your field to the consumer. How you handle the product is extremely important. Cold chain is paramount. So, having something centrally located made sense for our operation.”",
          "Meena Farms is taking the same dedication to quality and applying it to Meena Packing.",
          "“This will be the most state-of-the-art cherry facility probably in North America,” Medeiros said. “Each piece of fruit is picked by hand and each is sorted individually. Then it’s run under high speeds by a camera as it is rotated. There’s dozens of pictures taken of that piece of fruit externally. Internally, we can see if there’s some defect near the pit. We can sort them by size, shape, color, firmness and now there is even technology that will allow us to sort by Brix level, which is the sugar level. It’s put into a box and we can trace back to that box that piece of fruit to the ranch and where it came from. That’s how state-of-the-art we are talking about.”",
          "The facility is expected to be in operation for this harvest and Meena Packing is looking to hire from 250 to 300 workers for the season. Those interested in working at the facility can apply online at meenafarms.com or drop off a resume at the dropbox location at 581 4th Ave., in Gustine or call 209-710-5716.",
          ""
        ]
      }
    },
    {
      "thumbnail": {
        "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/21/images/Prodigal_donation.560a12a1.fill-300x200.jpg",
        "alt": "Prodigal Sons and Daughters Kiwanis donation"
      },
      "headline": "A PRODIGAL DONATION",
      "href": "https://www.turlockjournal.com/news/local/prodigal-donation/",
      "article": {
        "img": {
          "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/21/images/Prodigal_donation.max-1200x675.jpg"
        },
        "content": [
          "Tuesday evening was all about Prodigal Sons and Daughters, the faith-based addiction recovery ministry near downtown Turlock. The ministry played host to the Turlock Chamber of Commerce’s monthly mixer, networking with community members while also sharing their mission with attendees.",
          "",
          "Of the attendees were dozens of members of the Kiwanis of Great Turlock. The community service club surprised PSD employees with a $10,000 check to help fund facility operations.",
          "",
          "“Organizations like this are so important to our community,” said Kiwanis of Greater Turlock President Mike Staack. “The work they do is amazing and we need more people like them, but it can’t happen if we as a community don’t work together.”",
          "",
          "Prodigal Sons and Daughters helps an hundreds of individuals per month in their journey to sobriety. The ministry provides one-on-one counseling, group meetings, art therapy, teen drug education and more.",
          "",
          "The non-profit accepts donations year-round at www.prodigalsonsanddaughters.org/how-you-can-support-us-1.",
          ""
        ]
      }
    },
    {
      "thumbnail": {
        "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/17/images/ag_census_2.0fef7cea.fill-300x200.jpg",
        "alt": "almond harvesting"
      },
      "headline": "Stanislaus in top 10 of ag producing counties in the U.S.",
      "href": "https://www.turlockjournal.com/news/local/stanislaus-top-10-ag-producing-counties-us/",
      "article": {
        "img": {
          "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/17/images/ag_census_2.max-1200x675.jpg"
        },
        "content": [
          "Stanislaus County was one of the top 10 ag-producing counties in the entire nation during 2022, according the U.S. Department of Agriculture’s National Agricultural Statistics Service.",
          "NASS recently released the results of the 2022 Census of Agriculture, spanning more than 6 million data points about America’s farms and ranches and the people who operate them.",
          "Among the findings — California continues have nine of the top-10 counties in the U.S in agricultural production, and Stanislaus County is No. 8 on the list with a total production value of $2.9 billion, according to the report.",
          "Fresno County was first in the nation, with a total production value of $7 billion, followed by Tulare ($6.4B), Monterey ($5.5B), Kern ($5B), Merced ($4B), Imperial and San Joaquin ($3B) counties.",
          "“I think that goes to show you that we have a very strong and vibrant agriculture economy and community,” said Linda Pinfold, the Stanislaus County ag commissioner. “ I’m very proud and honored that I get to serve that community.”",
          "Santa Barbara and Grant County, Wash. — the only non-California county to crack the list — rounded out the top 10 with $2.6 billion total production value each.",
          "“Once again, California has the top agricultural counties in the nation, which is a testament to the resilience and innovation of all those involved in food production,” said California’s Food and Agriculture Secretary Karen Ross. “I wish to thank our partners at NASS for the very detailed work required to produce the Census. These data are essential as we consider allocation of resources in our ongoing commitment to help California’s farmers and ranchers remain sustainable and flourishing.”",
          "Census of Agriculture information, which is collected directly from producers, shows a continued decline in the total number of California farms. However, the data also show an increase in the value of agriculture sales in California.",
          "“I think it’s so cool to learn that we rank so high in the nation,” said Caitie Diemel, executive director of the county’s Farm Bureau. “Stanislaus County is pretty unique in that the average-size farm here is smaller than that of the state’s average farm. That’s because we have a lot of small, family-owned farms, working hard to produce so much good, safe food here in California, and I couldn’t be more proud.”",
          "Milk was the No. 1 commodity for Stanislaus County in 2022, followed by almonds, combining to make up 50 percent of the county’s entire production.",
          "The 2022 ag census shows the following key trends for the state:",
          "· The number of farms decreased to 63,134, down 10 percent from 2017 with an average size of 383 acres (up 10 percent) on 24.2 million acres of farmland (down 1 percent).",
          "· The market value of agricultural products sold totaled a national-best $59 billion — up $13.8 billion from 2017 — and that’s more than $15 billion ahead of No. 2 Iowa.",
          "· Total farm production expenses totaled $49.3 billion, up $11.5 billion from 2017.",
          "· At 16,699 farms, California is the top state using renewable energy producing systems in agriculture. Solar is the most common renewable energy producing system on farms and ranches in The Golden State.",
          "· Fresno County’s 2022 agricultural sales were greater than that of 23 separate states.",
          "· The average age of the California farmer is 59.9, up from 59.2 in 2017.",
          "It’s that last statistic that has Pinfold concerned about the future of farming.",
          "“Who’s going to be our future farmers?” said Pinfold. “Who’s going to take the mantle and keep that going strong? A lot of our farms are multi-generational. A lot of people grew up on farms but don’t come back to farm. Who’s going to be the next? That to me is important.”",
          "The national response rate for the 2022 Census of Agriculture was 61 percent; more than 40 percent of responses were submitted online. California’ response rate was 56 percent. Additional statistical reports, including state and county profiles and congressional districts, will be released throughout 2024.",
          ""
        ]
      }
    },
    {
      "thumbnail": {
        "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/14/images/Shaneyfelt_homecoming_3.6f392dd0.fill-300x200.jpg",
        "alt": "Shaneyfelt homecoming 3"
      },
      "headline": "Shaneyfelt's Homecoming",
      "href": "https://www.turlockjournal.com/news/local/shaneyfelts-homecoming/",
      "article": {
        "img": {
          "src": "https://centralca.cdn-anvilcms.net/media/images/2024/02/14/images/Shaneyfelt_homecoming_3.max-1200x675.jpg"
        },
        "content": [
          "After a month living at the Ronald McDonald House in Palo Alto and traveling to nearby Stanford Medical Center for routine check-ups following his Dec. 20 kidney transplant surgery, Turlock Christian middle schooler Jaxon Shaneyfelt and his family are back home. And similar to how the Turlock Christian campus community came together for a send-off on Dec. 18, hundreds filled the parking lot of Monte Vista Chapel on Monday to welcome him back to school.",
          "",
          "",
          "“We are overjoyed to welcome him back into our school community,” said Principal Nineb Shahbaz.",
          "Shaneyfelt, understandably, was also overjoyed.",
          "“It is really nice to be back with my friends,” he said. “They have been there for me from the start. Helping me look for a kidney and praying for me and I am really happy to be back at school. Today was a nice surprise.”",
          "The 14-year-old’s return to school brought a sense of normalcy that he hadn’t felt in more than a year. In December 2022, he was diagnosed with juvenile nephronophthisis — fibrosis that impairs kidney function and leads to life-threatening failure of kidney function. It wasn’t until this past November that doctors were able to match him with a living donor, 40-year-old Sarah Best of Sacramento.",
          "Shaneyfelt’s kidney function is normal and his body has adjusted to medication, though he will still be under a doctor’s care.",
          ""
        ]
      }
    }
  ]
}
